{"All about hashing": {"Chapter 1: What is hashing": {"Subchapters": {"1.0 What is hashing?": "Hashing is a cryptographic process that uses a 1-way hashing algorithm\n(E.g. MD5, SHA256, etc.) to turn data into a unique, shorter fixed-length string\nof random numbers & letters known as a hash value or, hash.\n• It is possible for 2 data to have the same hash.\n  This is known as a hash collision, although such occurrence is rare\n• A 1-way hashing algorithm means that you can't reverse the hash to get back\n  the original data\n  • This is different from encryption, which is 2-way (reversible)", "1.1 Will the hash be different or the same?": "Changing data's content → Hash will be different\nChanging data's metadata (E.g. file name) → Hash will be the same\nDuplicating a file → Both files' hashes will be the same\nCreate a new file that has the same content as another file → Both file's hashes\nwill be the same\nCreate a new file with the same content as another file but of a\ndifferent file type → Both file's hashes will be different", "1.2 What's the purpose of hashing?": "Hashing is used to:\n• Safely store sensitive data (E.g. Storing passwords in a database)\n• Authenticate you are who you say you are\n• Assure users that the data has not been modified (Data integrity)\n• Implement a hash table"}, "Bookmarked": true}, "Chapter 2: Message-Direct 5 (MD5)": {"Subchapters": {"2.0 What is MD5?": "MD5 is a cryptographic hash algorithm that generates a 128-bit hash,\ntypically represented as a sequence of 32 hexadecimal digits.\nSurprisingly, even though it suffers from a lot of vulnerabilities,\nMD5 is still widely used to this day", "2.1 How does MD5 work?": "1. The message to be hashed is padded such that its length is congruent to\n   448 modulo 512 (i.e. The message is extended so that it's just 64 bits away\n   from being a multiple of 512 bits long)\n   • Padding is performed even if the message length is already congruent\n     to 448 modulo 512\n   • How the padding is done: 1 '1' bit is appended to the message,\n     followed by '0' bits so that the length in bits of the padded message\n     becomes congruent to 448 modulo 512\n2. A 64-bit representation of the original bit length of the message is appended\n   to the result of step 1. If the original bit length is greater than 2^64,\n   only the low-order 64 bits of the original bit length are used\n   (These bits are appended as 2 32-bit words & appended low-order word first).\n   At this point, the resulting message (after padding with bits & the original bit\n   length) has a length that's an exact multiple of 512 bits. Equivalently, this\n   message has a length that's an exact multiple of 16 (32-bit) words\n3. A 4 word buffer (A, B, C, D), each a 32-bit register, is used to compute the\n   message digest. A, B, C & D are initialized to the following values in\n   hexadecimal (low-order bytes first):\n   +------------------+\n   |word A|01|23|45|67|\n   +------------------+\n   |word B|89|AB|CD|EF|\n   +------------------+\n   |word C|FE|DC|BA|98|\n   +------------------+\n   |word D|76|54|32|10|\n   +------------------+\n4. 4 auxiliary functions are defined, each taking the input as 3 32-bit words\n   & producing 1 32-bit word as the output:\n   +------------------------------+\n   |F(X,Y,Z) = XY or not(X)Z      |\n   +------------------------------+\n   |G(X,Y,Z) = XZ or Y not(Z)     |\n   +------------------------------+\n   |H(X,Y,Z) = X xor Y xor Z      |\n   +------------------------------+\n   |I(X,Y,Z) = Y xor (X or not(Z))|\n   +------------------------------+", "2.2 Pros and Cons of MD5": "Pros:\n• Low computational requirements\n• Easier to compare & store\n• Very easy to generate a message digest of the original message\n\nCons:\n• Hash collision is very common\n  • Thus prone to collision attacks (E.g. Birthday attack)", "2.3 Finding the MD5": "In Windows:\n+----------------------------------+\n|certutil -hashfile {FILE_NAME} md5|\n+----------------------------------+\n-hashfile:\nTell certutil you want to get the hash of a file\nFILE_NAME:\nThe file you want to get the hash of\n\nIn Linux/Mac:\n+------------------+\n|md5sum {FILE_NAME}|\n+------------------+\nFILE_NAME:\nThe file you want to get the hash of\n\nIn PowerShell:\n+---------------------------------------+\n|Get-FileHash {FILE_NAME} -Algorithm MD5|\n+---------------------------------------+\nFILE_NAME:\nThe file you want to get the hash of"}, "Bookmarked": true}}, "On-site, what you need to know": {"Chapter 1: Before going on-site": {"Subchapters": {"1.0 Did you bring everything?": "Before you head off to the scene of the crime, stop and ask yourself,\n\"Did I remember to bring everything that I might need when I'm on the scene?\"\nIt's important that you do a check before you set off, else... \nlet's not see what happens if you do forget something. So, in case you're\nwondering what should be brought, here's a list of what you need to bring\n(but not limited):\n• A fully charged laptop, along with its charger, a laptop lock, & a mouse &\n  external keyboard if needed\n  • It's best if you brought more than 1 laptop unless you want to spend the\n    night there & to be safe in case anything happens to that laptop\n  • Make sure your laptops are all clean, have plenty of space, & their antivirus\n    has been updated to the latest definition\n• Forensic disk duplicators & write blockers\n• Forensics software & its associated license keys\n• Live bootable disks & CDs (E.g. Kali)\n• Mobile device forensic kits & cables\n• Data cables (E.g. Micro-USB, USB-C, lightning, etc.) straight & crossover cables\n• A few external optical drives\n• Large capacity hard disks/SSDs for storing disk images, USB drives for smaller\n  amounts of data\n  • Make sure they're clean & empty to avoid confusion between data collected\n    at different crime scenes\n• Evidence containers, labels, pens, tape, & cable ties to uniquely mark\n  & package each evidence\n• Faraday bags for isolating devices from radio-based interference\n• Antistatic bags for storing components prone to damage by\n  electrostatic discharge (ESD)\n• A set of screwdrivers with a wide variety of attachments\n• Several kinds of pliers, especially a needle nose pliers\n• Wire cutters\n• Flashlights\n• A fully charged camera with plenty of space available\n  • Make sure the date, time & time zone are properly set\n  • Configure the camera to both place a timestamp on the photo & embed the\n    timestamp in the photo's metadata\n  • Bring blank, sanitised, removable storage cards to avoid confusion between\n    photographs taken at different crime scenes & in case the one you're\n    currently using has reached its limit\n\nIf you did forget to bring something and you're already there,\nyou need to know where & how you can quickly purchase the missing equipment", "1.1 Uhh... what's going on?": "Trust me when I say that you don't want to be that guy who has no idea about\nwhat's going on or what even the case is about.\nSo read up on the case beforehand, know about the network you will be dealing\nwith, the computers, storage media, peripherals, what encryption\n& security mechanisms are being used and how to deal with anti-forensics", "1.2 Preparing for an interview": "Ever wanted to be an interviewer? Well this is your chance!\nSometimes, the best place to get more information isn't in the systems but\nrather from the mouths of people who were there when the incident occurred\n(as long as they're trustworthy, that is). And just like any professional\ninterviewer, you want to prepare your questions a few days before the interview"}, "Bookmarked": false}, "Chapter 2: When on-site": {"Subchapters": {"2.0 You're at the scene of the crime, what do you do?": "Now that you're finally at the scene of the crime & have everything set up,\nmake sure you guard your stuff like your lives depend on it.\nDon't let any unauthorized person have any access to the electronic devices\nor assist you. Be weary of peripherals (E.g. mouse, keyboard, etc.) at the site\nas they may contain latent evidence like fingerprints/DNA.\nControl the entry points to the crime scene and the most important thing you\nneed to remember while you're there, stay safe."}, "Bookmarked": true}, "Chapter 3: After going on-site": {"Subchapters": {"3.0 Pack up, it's time to go home": "After a long hard day of work, you're finally done.\nYou've gained all the information & data you need, now that's left is to go back\nto your workplace. Make sure you didn't leave anything behind, you don't want\nto make another trip back."}, "Bookmarked": false}}}